# ElementId Constructor (BuiltInCategory) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId Constructor (BuiltInCategory)
ElementId Class See Also
---
Create an ElementId handle with the given BuiltInCategory id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId(
	BuiltInCategory categoryId
)
```

Visual Basic
---
```text
Public Sub New ( _
	categoryId As BuiltInCategory _
)
```

Visual C++
---
```text
public:
ElementId(
	BuiltInCategory categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..BuiltInCategoryThe id.
# See Also
ElementId Class
ElementId Overload
Autodesk.Revit.DB Namespace